src/cf/src/InformationRegisters/ТарифныеСтавки/ТарифныеСтавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифныеСтавки</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидПриказа</name>
    <type>
      <types>EnumRef.ВидыКадровыхПриказов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОклада</name>
    <type>
      <types>EnumRef.ВариантыОклада</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ТарифныеСтавки/ManagerModule.bsl
Функция ПолучитьПоСотрудникуЗаПериод(Сотрудник, НачалоПериода, КонецПериода) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Период КАК Период,
	                      |	ВЗ.Сотрудник КАК Сотрудник,
	                      |	ВЗ.Должность КАК Должность,
	                      |	ВЗ.Оклад КАК Оклад,
	                      |	ВЗ.ВариантОклада КАК ВариантОклада
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ТССрезПоследних.Период КАК Период,
	                      |		ТССрезПоследних.Сотрудник КАК Сотрудник,
	                      |		ТССрезПоследних.Должность КАК Должность,
	                      |		ТССрезПоследних.Оклад КАК Оклад,
	                      |		ТССрезПоследних.ВариантОклада КАК ВариантОклада
	                      |	ИЗ
	                      |		РегистрСведений.ТарифныеСтавки.СрезПоследних(&НачалоПериода, Сотрудник = &Сотрудник) КАК ТССрезПоследних
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		ТС.Период,
	                      |		ТС.Сотрудник,
	                      |		ТС.Должность,
	                      |		ТС.Оклад,
	                      |		ТС.ВариантОклада
	                      |	ИЗ
	                      |		РегистрСведений.ТарифныеСтавки КАК ТС
	                      |	ГДЕ
	                      |		ТС.Период МЕЖДУ &НачалоПериода И &КонецПериода
	                      |		И ТС.Сотрудник = &Сотрудник) КАК ВЗ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период УБЫВ");
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьВсехСотрудников(ДатаСреза, МестоХранения) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТарифныеСтавки.Сотрудник КАК Сотрудник
	                      |ИЗ
	                      |	РегистрСведений.ТарифныеСтавки.СрезПоследних(&ДатаСреза, МестоХранения = &МестоХранения) КАК ТарифныеСтавкиСрезПоследних
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавки КАК ТарифныеСтавки
	                      |		ПО ТарифныеСтавкиСрезПоследних.Период = ТарифныеСтавки.Период
	                      |			И ТарифныеСтавкиСрезПоследних.Сотрудник = ТарифныеСтавки.Сотрудник
	                      |ГДЕ
	                      |	ТарифныеСтавкиСрезПоследних.ВидПриказа <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхПриказов.Увольнение)");
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("МестоХранения", МестоХранения);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
КонецФункции

Функция ПолучитьДанныеСотрудника(Сотрудник, ДатаСреза) Экспорт
	Результат = Новый Структура("Сотрудник, Организация, Должность, ГрафикРаботы, МестоХранения", Сотрудник);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТарифныеСтавкиСрезПоследних.Сотрудник КАК Сотрудник,
	                      |	ТарифныеСтавкиСрезПоследних.Организация КАК Организация,
	                      |	ТарифныеСтавкиСрезПоследних.Должность КАК Должность,
	                      |	ТарифныеСтавкиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
	                      |	ТарифныеСтавкиСрезПоследних.МестоХранения КАК МестоХранения
	                      |ИЗ
	                      |	РегистрСведений.ТарифныеСтавки.СрезПоследних(&ДатаСреза, Сотрудник = &Сотрудник) КАК ТарифныеСтавкиСрезПоследних");
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Рез = Запрос.Выполнить();
		Если Не Рез.Пустой() Тогда
			ЗаполнитьЗначенияСвойств(Результат, Рез.Выгрузить()[0]);	
		КонецЕсли;	
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Возвращает сотрудников, работающих в подразделении (месте хранения) сотрудника на дату среза.
//
// Параметры:
//  Сотрудник - СправочникСсылка.ФизическиеЛица - сотрудник.
//  ДатаСреза - Дата - дата среза тарифных ставок.
//
// Возвращаемое значение:
//  Массив - СправочникСсылка.ФизическиеЛица; пустой, если подразделение сотрудника не определено.
//
Функция ПолучитьВсехСотрудниковВПодразделенииСотрудника(Сотрудник, ДатаСреза) Экспорт
	МестоХранения = ПолучитьДанныеСотрудника(Сотрудник, ДатаСреза).МестоХранения;
	Если Не ЗначениеЗаполнено(МестоХранения) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	Возврат ПолучитьВсехСотрудников(ДатаСреза, МестоХранения);
КонецФункции

// Возвращает сотрудников, работающих в перечисленных подразделениях (местах хранения) на дату среза.
//
// Параметры:
//  МестаХранения - Массив - СправочникСсылка.МестаХранения.
//  ДатаСреза - Дата - дата среза тарифных ставок.
//
// Возвращаемое значение:
//  Массив - СправочникСсылка.ФизическиеЛица.
//
Функция ПолучитьВсехСотрудниковВПодразделениях(МестаХранения, ДатаСреза) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ТарифныеСтавкиСрезПоследних.Сотрудник КАК Сотрудник
	                      |ИЗ
	                      |	РегистрСведений.ТарифныеСтавки.СрезПоследних(&ДатаСреза, МестоХранения В (&МестаХранения)) КАК ТарифныеСтавкиСрезПоследних
	                      |ГДЕ
	                      |	ТарифныеСтавкиСрезПоследних.ВидПриказа <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхПриказов.Увольнение)");
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("МестаХранения", МестаХранения);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
КонецФункции
